app/controllers/configuration_controller.rb

  def settings
    @config = Configuration.get_multiple_configs_as_hash ['InstitutionName', 'InstitutionAddress', 'InstitutionPhoneNo', \
        'StudentAttendanceType', 'CurrencyType', 'ExamResultType', 'AdmissionNumberAutoIncrement','EmployeeNumberAutoIncrement', \
        'NetworkState','FinancialYearStartDate','FinancialYearEndDate']

    if request.post?

      unless params[:upload].nil?
        @temp_file=params[:upload][:datafile]
        unless FILE_EXTENSIONS.include?(File.extname(@temp_file.original_filename).downcase)
          flash[:notice] = 'Invalid Extention. Image must be .JPG'
          redirect_to :action => "settings"  and return
        end
        if @temp_file.size > FILE_MAXIMUM_SIZE_FOR_FILE
          flash[:notice] = 'Soubor je příliš velky. Velikost souboru musí být menší než 1 MB'
          redirect_to :action => "settings" and return
        end
      end

      Configuration.set_config_values(params[:configuration])
      Configuration.save_institution_logo(params[:upload]) unless params[:upload].nil?
---
UPDATE `configurations` SET `config_value` = 'Evidenční systém ŠSK Beskydy' WHERE `id` = 1