app/controllers/courses_controller.rb

  def create
    @course = Course.new params[:course]
    if @course.save
---
INSERT INTO `courses` (`created_at`, `code`, `updated_at`, `course_name`, `is_deleted`, `section_name`) VALUES('2011-10-24 19:53:02', 'KAD', '2011-10-24 19:53:02', 'Kadeti', 0, '')