app/controllers/employee_attendance_controller.rb

SELECT * FROM `employee_leave_types` WHERE (status = true)
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`reporting_manager_id` = 1)
---
    def leaves
        @leave_types = EmployeeLeaveType.find(:all, :conditions=>"status = true")
        @employee = Employee.find(params[:id])
        @reporting_employees = Employee.find_all_by_reporting_manager_id(@employee.id)

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
SELECT * FROM `apply_leaves` WHERE (approved = false AND viewed_by_manager = false) AND (`apply_leaves`.`employee_id` = 1) ORDER BY start_date DESC
SELECT * FROM `apply_leaves` WHERE (employee_id = '1') ORDER BY start_date DESC LIMIT 0, 12
---
    def individual_leave_applications
        @employee = Employee.find(params[:id])
        @pending_applied_leaves = ApplyLeave.find_all_by_employee_id(@employee.id, :conditions=> "approved = false AND viewed_by_manager = false", :order=>"start_date DESC")
        @applied_leaves = ApplyLeave.paginate(:page => params[:page],  :conditions=>[ "employee_id = '#{@employee.id}'"], :order=>"start_date DESC")