app/controllers/employee_controller.rb

SELECT * FROM `employee_categories` WHERE (status = 1) ORDER BY name asc
---
  def add_category
    @categories = EmployeeCategory.find(:all,:order => "name asc",:conditions=>'status = 1')

SELECT * FROM `employee_categories` WHERE (`employee_categories`.`id` = 1)
SELECT * FROM `employees` WHERE (employee_category_id = 1)
UPDATE `employee_categories` SET `name` = 'Admin' WHERE `id` = 1
---
  def edit_category
    @category = EmployeeCategory.find(params[:id])
    employees = Employee.find(:all ,:conditions=>"employee_category_id = #{params[:id]}")
    if request.post?
      if (params[:category][:status] == 'false' and employees.blank?) or params[:category][:status] == 'true'

        if @category.update_attributes(params[:category])

SELECT * FROM `employee_positions` WHERE (status = 1) ORDER BY name asc
SELECT * FROM `employee_categories` WHERE (`employee_categories`.`id` = 1)
---
  def add_position
    @positions = EmployeePosition.find(:all,:order => "name asc",:conditions=>'status = 1')
    @inactive_positions = EmployeePosition.find(:all,:order => "name asc",:conditions=>'status = 0')
    @categories = EmployeeCategory.find(:all,:order => "name asc",:conditions=> 'status = 1')

SELECT * FROM `employee_positions` WHERE (`employee_positions`.`id` = 1)
SELECT * FROM `employees` WHERE (employee_position_id = 1)
UPDATE `employee_positions` SET `name` = 'Admin' WHERE `id` = 1
---
  def edit_position
    @categories = EmployeeCategory.find(:all)
    @position = EmployeePosition.find(params[:id])
    employees = Employee.find(:all ,:conditions=>"employee_position_id = #{params[:id]}")
    if request.post?
      if (params[:position][:status] == 'false' and employees.blank?) or params[:position][:status] == 'true'
        if @position.update_attributes(params[:position])

SELECT * FROM `employee_departments` WHERE (status = 1) ORDER BY name asc
---
  def add_department
    @departments = EmployeeDepartment.find(:all,:order => "name asc",:conditions=>'status = 1')

SELECT * FROM `employee_departments` WHERE (`employee_departments`.`id` = 1)
SELECT * FROM `employees` WHERE (employee_department_id = 1)
UPDATE `employee_departments` SET `name` = 'Admin' WHERE `id` = 1
---
  def edit_department
    @department = EmployeeDepartment.find(params[:id])
    employees = Employee.find(:all ,:conditions=>"employee_department_id = #{params[:id]}")
    if request.post?
      if (params[:department][:status] == 'false' and employees.blank?) or params[:department][:status] == 'true'
        if @department.update_attributes(params[:department])

SELECT `employee_grades`.id FROM `employee_grades` WHERE (`employee_grades`.`name` = BINARY 'Trenér II.třídy') LIMIT 1
INSERT INTO `employee_grades` (`name`, `max_hours_week`, `priority`, `max_hours_day`, `status`) VALUES('Trenér II.třídy', 20, 1, 4, 1)
---
  def add_grade
    @grades = EmployeeGrade.find(:all,:order => "name asc",:conditions=>'status = 1')
    @inactive_grades = EmployeeGrade.find(:all,:order => "name asc",:conditions=>'status = 0')
    @grade = EmployeeGrade.new(params[:grade])
    if request.post? and @grade.save

SELECT * FROM `employee_grades` WHERE (`employee_grades`.`id` = 1)
SELECT * FROM `employees` WHERE (employee_grade_id = 1)
UPDATE `employee_grades` SET `name` = 'Admin' WHERE `id` = 1
---
  def edit_grade
    @grade = EmployeeGrade.find(params[:id])
    employees = Employee.find(:all ,:conditions=>"employee_grade_id = #{params[:id]}")
    if request.post?
      if (params[:grade][:status] == 'false' and employees.blank?) or params[:grade][:status] == 'true'
        if @grade.update_attributes(params[:grade])

SELECT * FROM `employee_categories` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employee_grades` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employee_departments` WHERE (status = true) ORDER BY name asc
SELECT * FROM `countries`
SELECT `employees`.id FROM `employees` WHERE (`employees`.`employee_number` = BINARY 'E1' AND `employees`.id <> 2) LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'EmployeeNumberAutoIncrement') LIMIT 1
INSERT INTO `employees` (`employee_position_id`, `employee_grade_id`, `experience_year`, `experience_month`, `joining_date`, `home_state`, `created_at`, `photo_file_size`, `job_title`, `employee_department_id`, `nationality_id`, `office_city`, `photo_file_name`, `photo_data`, `updated_at`, `employee_category_id`, `home_city`, `photo_content_type`, `gender`, `father_name`, `home_pin_code`, `office_state`, `home_phone`, `employee_number`, `status_description`, `children_count`, `husband_name`, `blood_group`, `office_pin_code`, `user_id`, `last_name`, `mother_name`, `fax`, `qualification`, `experience_detail`, `date_of_birth`, `home_country_id`, `office_address_line1`, `office_phone1`, `status`, `marital_status`, `home_address_line1`, `office_address_line2`, `office_country_id`, `office_phone2`, `first_name`, `middle_name`, `reporting_manager_id`, `home_address_line2`, `mobile_phone`, `email`) VALUES(1, 2, NULL, NULL, '2011-10-31', NULL, '2011-10-31 07:52:08', NULL, '', 1, 45, NULL, NULL, NULL, '2011-10-31 07:52:08', 1, NULL, NULL, 1, '', NULL, NULL, NULL, 'E1', NULL, NULL, '', '', NULL, 2, '', '', NULL, '', '', '2011-10-31', NULL, NULL, NULL, 1, 'Single', NULL, NULL, NULL, NULL, 'Ivan', '', NULL, NULL, NULL, 'noreplyE1@fedena.com')
---
  def admission1
    @user = current_user
    @user_name = @user.username
    @employee1 = @user.employee_record
    @categories = EmployeeCategory.find(:all,:order => "name asc",:conditions => "status = true")
    @positions = []
    @grades = EmployeeGrade.find(:all,:order => "name asc",:conditions => "status = true")
    @departments = EmployeeDepartment.find(:all,:order => "name asc",:conditions => "status = true")
    @nationalities = Country.all
    @employee = Employee.new(params[:employee])
    @last_admitted_employee = Employee.find(:last,:conditions=>"employee_number != 'admin'")
    @config = Configuration.find_by_config_key('EmployeeNumberAutoIncrement')

    if request.post?

      unless params[:employee][:employee_number].to_i ==0
        @employee.employee_number= "E" + params[:employee][:employee_number].to_s
      end
      if @employee.save

SELECT * FROM `employee_leave_types`
---
        end


        @leave_type = EmployeeLeaveType.all

SELECT * FROM `employee_positions` WHERE (`employee_positions`.`employee_category_id` = '')
---
        flash[:notice] = "Údaje zaměstnance #{@employee.first_name} uloženy"
        redirect_to :controller =>"employee" ,:action => "admission2", :id => @employee.id
      end
      @positions = EmployeePosition.find_all_by_employee_category_id(params[:employee][:employee_category_id])

SELECT * FROM `employee_categories` WHERE (`employee_categories`.`id` = 1)
SELECT * FROM `employee_positions` WHERE (status = 1) AND (`employee_positions`.`employee_category_id` = 1)
---
  def update_positions
    category = EmployeeCategory.find(params[:category_id])
    @positions = EmployeePosition.find_all_by_employee_category_id(category.id,:conditions=>'status = 1')

SELECT * FROM `employee_categories` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employee_grades` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employee_departments` WHERE (status = true) ORDER BY name asc
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
UPDATE `employees` SET `gender` = 1, `updated_at` = '2011-11-13 09:04:58', `job_title` = '', `middle_name` = '', `first_name` = 'admin', `experience_detail` = '', `qualification` = '' WHERE `id` = 1
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def edit1
    @categories = EmployeeCategory.find(:all,:order => "name asc", :conditions => "status = true")
    @positions = EmployeePosition.find(:all)
    @grades = EmployeeGrade.find(:all,:order => "name asc", :conditions => "status = true")
    @departments = EmployeeDepartment.find(:all,:order => "name asc", :conditions => "status = true")
    @employee = Employee.find(params[:id])
    @employee_user = @employee.user
    if request.post? and @employee.update_attributes(params[:employee])
      if params[:employee][:gender] == "true"
        Employee.update(@employee.id, :gender => true)
      else
        Employee.update(@employee.id, :gender => false)
      end

      if params[:employee][:status] == "true"
        Employee.update(@employee.id, :status => true)
      else
        Employee.update(@employee.id, :status => false)
      end

      flash[:notice] = "Zaměstnanec #{@employee.first_name} hlavní údaj aktualizován"

SELECT * FROM `countries`
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
---
  def edit_personal
    @nationalities = Country.all
    @employee = Employee.find(params[:id])

SELECT * FROM `employees` WHERE (`employees`.`id` = 2)
UPDATE `employees` SET `home_phone` = '', `updated_at` = '2011-10-31 07:52:17', `office_city` = '', `office_state` = '', `fax` = '', `home_city` = '', `home_address_line2` = '', `office_phone2` = '', `office_country_id` = 76, `home_address_line1` = '', `mobile_phone` = '', `office_phone1` = '', `home_country_id` = 76, `office_address_line2` = '', `home_pin_code` = '', `office_address_line1` = '', `office_pin_code` = '', `home_state` = '' WHERE `id` = 2
SELECT `employees`.id FROM `employees` WHERE (`employees`.`employee_number` = BINARY 'E1' AND `employees`.id <> 2) LIMIT 1
---
  def admission2
    @countries = Country.find(:all)
    @employee = Employee.find(params[:id])
    if request.post? and @employee.update_attributes(params[:employee])
      sms_setting = SmsSetting.new()
      if sms_setting.application_sms_active and sms_setting.employee_sms_active
        recipient = ["#{@employee.mobile_phone}"]
        message = "Připojují info pro #{@employee.first_name}. Username: #{@employee.employee_number}, Password: #{@employee.employee_number}123. Prosím změnte si své heslo po přihlášení."

SELECT * FROM `employees` WHERE (`employees`.`id` = 2)
SELECT * FROM `bank_fields` WHERE (status = true)
---
  def admission3
    @employee = Employee.find(params[:id])
    @bank_fields = BankField.find(:all, :conditions=>"status = true")

SELECT * FROM `employees` WHERE (`employees`.`id` = 2)
SELECT * FROM `additional_fields` WHERE (status = true)
---
  def admission3_1
    @employee = Employee.find(params[:id])
    @additional_fields = AdditionalField.find(:all, :conditions=>"status = true")

SELECT * FROM `privileges` WHERE (`privileges`.`id` IN ('1','2','3','4','5','6','7','8','12','15','16'))
SELECT * FROM `users` WHERE (`users`.`username` = 'E1') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.user_id = 2) LIMIT 1
SELECT * FROM `privileges` INNER JOIN `privileges_users` ON `privileges`.id = `privileges_users`.privilege_id WHERE (`privileges_users`.user_id = 1 )
---
  def edit_privilege
    @privileges = Privilege.find(:all)
    @user = User.find_by_username(params[:id])
    @employee = @user.employee_record
    if request.post?
      new_privileges = params[:user][:privilege_ids] if params[:user]
      new_privileges ||= []
      @user.privileges = Privilege.find_all_by_id(new_privileges)

SELECT * FROM `employees` WHERE (`employees`.`id` = 2)
---
  def admission4
    @departments = EmployeeDepartment.find(:all)
    @categories  = EmployeeCategory.find(:all)
    @positions   = EmployeePosition.find(:all)
    @grades      = EmployeeGrade.find(:all)
    if request.post?
      @employee = Employee.find(params[:id])

SELECT * FROM `employee_departments`
SELECT * FROM `employee_categories`
SELECT * FROM `employee_positions`
SELECT * FROM `employee_grades`
---
  def search
    @departments = EmployeeDepartment.all
    @categories  = EmployeeCategory.all
    @positions   = EmployeePosition.all
    @grades      = EmployeeGrade.all

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
SELECT * FROM `reminders` WHERE (is_read = false) AND (`reminders`.`recipient` = 1)
---
  def profile
    @current_user = current_user
    @employee = Employee.find(params[:id])
    @new_reminder_count = Reminder.find_all_by_recipient(@current_user.id, :conditions=>"is_read = false")

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
---
  def profile_general
    @employee = Employee.find(params[:id])

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
---
  def profile_personal
    @employee = Employee.find(params[:id])

SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '1') ORDER BY first_name ASC
---
  def employees_list
    department_id = params[:department_id]
    @employees = Employee.find_all_by_employee_department_id(department_id,:order=>'first_name ASC')

SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
SELECT * FROM `employee_attendances` WHERE (`employee_attendances`.`employee_id` = 1)
SELECT * FROM `employee_leave_types` WHERE (status = true)
SELECT `employee_leaves`.* FROM `employee_leaves` INNER JOIN `employee_leave_types` ON `employee_leave_types`.id = `employee_leaves`.employee_leave_type_id WHERE (status = true) AND (`employee_leaves`.`employee_id` = 1)
---
  def view_attendance
    @employee = Employee.find(params[:id])
    @attendance_report = EmployeeAttendance.find_all_by_employee_id(@employee.id)
    @leave_types = EmployeeLeaveType.find(:all, :conditions => "status = true")
    @leave_count = EmployeeLeave.find_all_by_employee_id(@employee,:joins=>:employee_leave_type,:conditions=>"status = true")

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `subjects` WHERE (is_deleted=false) AND (`subjects`.`batch_id` = 1)
---
  def update_subjects
    batch = Batch.find(params[:batch_id])
    @subjects = Subject.find_all_by_batch_id(batch.id,:conditions=>"is_deleted=false")

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = 1)
SELECT * FROM `employee_departments` WHERE (`employee_departments`.`status` = 1)
---
  def select_department
    @subject = Subject.find(params[:subject_id])
    @assigned_employee = EmployeesSubject.find_all_by_subject_id(@subject.id)
    @departments = EmployeeDepartment.find(:all, :conditions =>{:status=>true})

SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`status` = 1) AND (`employees`.`employee_department_id` = '1')
---
  def update_employees
    @subject = Subject.find(params[:subject_id])
    @employees = Employee.find_all_by_employee_department_id(params[:department_id], :conditions =>{:status=>true})

SELECT * FROM `employee_departments` WHERE (`employee_departments`.`status` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = 1)
INSERT INTO `employees_subjects` (`employee_id`, `subject_id`) VALUES(1, 1)
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = 1)
---
  def assign_employee
    @departments = EmployeeDepartment.find(:all,:conditions =>{:status=>true})
    @subject = Subject.find(params[:id1])
    @employees = Employee.find_all_by_employee_department_id(Employee.find(params[:id]).employee_department_id)
    EmployeesSubject.create(:employee_id => params[:id], :subject_id => params[:id1])
    @assigned_employee = EmployeesSubject.find_all_by_subject_id(@subject.id)

SELECT * FROM `employees` WHERE (reporting_manager_id=3)
---
  def remove
    @employee = Employee.find(params[:id])

SELECT * FROM `employees` WHERE (`employees`.`id` = 3)
DELETE FROM `employees` WHERE `id` = 3
DELETE FROM `users` WHERE `id` = 3
---
  def delete
    employee = Employee.find(params[:id])
    user = User.destroy_all(:username => employee.employee_number) #unless user.nil?