app/controllers/finance_controller.rb

  def index
    @hr = Configuration.find_by_config_value("HR")
---
SELECT * FROM `configurations` WHERE (`configurations`.`config_value` = 'Finance') LIMIT 1