app/controllers/news_controller.rb

INSERT INTO `news` (`created_at`, `title`, `updated_at`, `content`, `author_id`) VALUES('2011-10-30 07:11:08', 'Pokus', '2011-10-30 07:11:08', '<p>testovac&iacute; zpr&aacute;va</p>', 1)
---
  def add
    @news = News.new(params[:news])
    @news.author = current_user
    if request.post? and @news.save

INSERT INTO `news_comments` (`created_at`, `updated_at`, `content`, `author_id`, `news_id`) VALUES('2011-10-31 07:42:06', '2011-10-31 07:42:06', 'pokus', 1, 1)
---
  def add_comment
    @cmnt = NewsComment.new(params[:comment])
    @cmnt.author = current_user
    @cmnt.save

SELECT * FROM `news` ORDER BY created_at DESC LIMIT 0, 12
---
  def all
    @news = News.paginate :page => params[:page]

SELECT * FROM `news_comments` WHERE (`news_comments`.`id` = 1)
DELETE FROM `news_comments` WHERE `id` = 1
---
  def delete_comment
    @comment = NewsComment.find(params[:id])
    NewsComment.destroy(params[:id])

SELECT * FROM `news` WHERE (`news`.`id` = 1) ORDER BY created_at DESC
---
  def view
    @current_user = current_user
    @news = News.find(params[:id])