app/controllers/payroll_controller.rb

SELECT * FROM `employees` WHERE (`employees`.`id` = 2)
SELECT * FROM `payroll_categories` WHERE (`payroll_categories`.`payroll_category_id` IS NULL AND `payroll_categories`.`status` = 1)
SELECT * FROM `employee_salary_structures` WHERE (`employee_salary_structures`.`employee_id` = 2)
---
  def manage_payroll
    @employee = Employee.find(params[:id])
    @independent_categories = PayrollCategory.find_all_by_payroll_category_id_and_status(nil, true)
    @dependent_categories = PayrollCategory.find_all_by_status(true, :conditions=>"payroll_category_id != \'\'")
    payroll_created = EmployeeSalaryStructure.find_all_by_employee_id(@employee.id)