app/controllers/student_controller.rb

  def admission1
    @student = Student.new(params[:student])
    @application_sms_enabled = SmsSetting.find_by_settings_key("ApplicationEnabled")
    @last_admitted_student = Student.find(:last)
    @config = Configuration.find_by_config_key('AdmissionNumberAutoIncrement')
    if request.post?
      if @config.config_value.to_i == 1
        @exist = Student.find_by_admission_no(params[:student][:admission_no])
---
SELECT * FROM `sms_settings` WHERE (`sms_settings`.`settings_key` = 'ApplicationEnabled') LIMIT 1
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'AdmissionNumberAutoIncrement') LIMIT 1
SELECT `students`.id FROM `students` WHERE (`students`.`admission_no` = BINARY '1') LIMIT 1

  def list_students_by_course
    @students = Student.find_all_by_batch_id(params[:batch_id], :order => 'first_name ASC')
---
SELECT * FROM `students` WHERE (`students`.`batch_id` = '1') ORDER BY first_name ASC

  def advanced_search
    @batches = Batch.all
---
SELECT * FROM `batches`

  def find_student
    @student = Student.find params[:id]
---
SELECT * FROM `students` ORDER BY students.id DESC LIMIT 1