app/controllers/subjects_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
---
  def new
    @subject = Subject.new
    @batch = Batch.find params[:id] if request.xhr? and params[:id]

INSERT INTO `subjects` (`name`, `created_at`, `code`, `max_weekly_classes`, `updated_at`, `batch_id`, `no_exams`, `is_deleted`, `elective_group_id`) VALUES('Trénink', '2011-10-24 19:53:38', 'TRN', 20, '2011-10-24 19:53:38', 1, 1, 0, NULL)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`batch_id` = 1)
---
  def create
    @subject = Subject.new(params[:subject])
    @batch = @subject.batch
    if @subject.save
      if params[:subject][:elective_group_id] == ""
        @subjects = @subject.batch.normal_batch_subject
        @normal_subjects = @subject
        @elective_groups = ElectiveGroup.find_all_by_batch_id(@batch.id)

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `elective_groups` WHERE (`elective_groups`.`is_deleted` = 0) AND (`elective_groups`.`batch_id` = '1')
---
  def show
    if params[:batch_id] == ''
      @subjects = []
    else
      @batch = Batch.find params[:batch_id]
      @subjects = @batch.normal_batch_subject
      @elective_groups = ElectiveGroup.find_all_by_batch_id(params[:batch_id], :conditions =>{:is_deleted=>false})