app/controllers/timetable_controller.rb

  def generate
    @batches = Batch.active
    if request.post?
      @batch = Batch.find params[:timetable][:batch_id]
      @config = Configuration.find_by_config_key('StudentAttendanceType')
      @start_date = @batch.start_date.to_date
      @end_date = @batch.end_date.to_date
      not_set_for_batch = Weekday.for_batch(@batch.id).empty?
      set = 0
      (@start_date..@end_date).each do |d|
        weekday = not_set_for_batch ? (Weekday.find_by_batch_id_and_weekday(nil,d.wday)) :  (Weekday.find_by_batch_id_and_weekday(@batch.id,d.wday))
        unless weekday.nil?
          @period = PeriodEntry.find_all_by_month_date_and_batch_id(d,@batch.id)
          if @period.empty?
            unless Event.is_a_holiday?(d)
              unless @config.config_value == 'Daily'
                entries = TimetableEntry.find_all_by_weekday_id_and_batch_id(weekday.id, @batch.id)
                entries.each do |tte|
                  if tte.subject.nil?
                    PeriodEntry.create(:month_date=> d, :batch_id => @batch.id,:class_timing_id => tte.class_timing_id, :employee_id => tte.employee_id)
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'StudentAttendanceType') LIMIT 1
SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` = 1 AND `weekdays`.`weekday` = 1) ORDER BY weekday asc LIMIT 1
SELECT count(*) AS count_all FROM `weekdays` WHERE (`weekdays`.`batch_id` = 1)
SELECT * FROM `period_entries` WHERE (`period_entries`.`month_date` = '2011-10-25' AND `period_entries`.`batch_id` = 1)
INSERT INTO `period_entries` (`class_timing_id`, `month_date`, `batch_id`, `subject_id`, `employee_id`) VALUES(NULL, '2011-10-25', 1, NULL, NULL)

def select_class2
  @weekday = ["Neděle", "Pondělí", "Úterý", "Streda", "Čtvrtek", "Pátek", "Sobota"]
  @batches = Batch.active
  if request.post?
    unless params[:timetable_entry][:batch_id].empty?
      @batch = Batch.find(params[:timetable_entry][:batch_id])
      @class_timings = ClassTiming.find_all_by_batch_id(@batch.id, :conditions => "is_break = false")
      if @class_timings.empty?
        @class_timings = ClassTiming.default
      end
      @day = Weekday.find_all_by_batch_id(@batch.id)
      if @day.empty?
        @day = Weekday.default
      end
      @day.each do |d|
        @class_timings.each do |p|
          TimetableEntry.create(:batch_id=>@batch.id, :weekday_id => d.id, :class_timing_id => p.id) \
            if TimetableEntry.find_by_batch_id_and_weekday_id_and_class_timing_id(@batch.id, d.id, p.id).nil?
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `class_timings` WHERE (`class_timings`.`is_break` = 0 AND `class_timings`.`batch_id` IS NULL) ORDER BY start_time ASC
SELECT * FROM `timetable_entries` WHERE (`timetable_entries`.`weekday_id` = 6 AND `timetable_entries`.`batch_id` = 1 AND `timetable_entries`.`class_timing_id` = 6) LIMIT 1
SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` IS NULL) ORDER BY weekday asc
INSERT INTO `timetable_entries` (`class_timing_id`, `batch_id`, `subject_id`, `employee_id`, `weekday_id`) VALUES(2, 1, NULL, NULL, 1)

def edit2
  @weekday = ["Neděle", "Pondělí", "Úterý", "Streda", "Čtvrtek", "Pátek", "Sobota"]
  @errors = {"messages" => []}
  @batch = Batch.find(params[:id])
  @timetable = TimetableEntry.find_all_by_batch_id(params[:id])
  @class_timing = ClassTiming.find_all_by_batch_id(@batch.id, :conditions =>[ "is_break = false"], :order =>'start_time ASC')
  if @class_timing.empty?
    @class_timing = ClassTiming.default
  end
  @day = Weekday.find_all_by_batch_id(@batch.id)
  if @day.empty?
    @day = Weekday.default
  end
  @subjects = Subject.find_all_by_batch_id(@batch.id)
---
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `timetable_entries` WHERE (`timetable_entries`.`batch_id` = '1')
SELECT * FROM `class_timings` WHERE (`class_timings`.`is_break` = 0 AND `class_timings`.`batch_id` IS NULL) ORDER BY start_time ASC
SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` IS NULL) ORDER BY weekday asc
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` IS NULL) GROUP BY elective_group_id

def update_employees
  @weekday = ["Neděle", "Pondělí", "Úterý", "Streda", "Čtvrtek", "Pátek", "Sobota"]
  if params[:subject_id] == ""
    render :text => ""
    return
  end
  @employees_subject = EmployeesSubject.find_all_by_subject_id(params[:subject_id])
---
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`subject_id` = '1')

def update_multiple_timetable_entries2
  @weekday = ["Neděle", "Pondělí", "Úterý", "Streda", "Čtvrtek", "Pátek", "Sobota"]
  employees_subject = EmployeesSubject.find(params[:emp_sub_id])
  tte_ids = params[:tte_ids].split(",").each {|x| x.to_i}
  @batch = employees_subject.subject.batch
  subject = employees_subject.subject
  employee = employees_subject.employee
  @validation_problems = {}

  tte_ids.each do |tte_id|
    tte = TimetableEntry.find(tte_id)
    errors = { "info" => {"sub_id" => employees_subject.subject_id, "emp_id"=> employees_subject.employee_id,"tte_id" => tte_id},
      "messages" => [] }

    # check for weekly subject limit.
    errors["messages"] << "Vyberte třídu pro pokračování." \
      if subject.max_weekly_classes <= TimetableEntry.count(:conditions => "subject_id = #{subject.id}") unless subject.max_weekly_classes.nil?
---
SELECT * FROM `employees_subjects` WHERE (`employees_subjects`.`id` = 1)
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
SELECT * FROM `timetable_entries` WHERE (`timetable_entries`.`id` = 6)
SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
SELECT * FROM `employees` WHERE (`employees`.`id` = 1)
SELECT * FROM `subjects` WHERE (elective_group_id IS NOT NULL AND is_deleted = false) AND (`subjects`.`batch_id` = 1) GROUP BY elective_group_id
SELECT * FROM `timetable_entries` WHERE (`timetable_entries`.`batch_id` = 1)

      if employee.max_hours_per_week <= TimetableEntry.count(:conditions => "employee_id = #{employee.id}") unless employee.max_hours_per_week.nil?

    if errors["messages"].empty?
      TimetableEntry.update(tte_id, :subject_id => subject.id, :employee_id=>employee.id)
---
UPDATE `timetable_entries` SET `subject_id` = 1, `employee_id` = 1 WHERE `id` = 6