app/controllers/user_controller.rb

SELECT * FROM `users`
---
    def all
        @users = User.all

SELECT * FROM `users` WHERE (`users`.`admin` = 1) ORDER BY first_name ASC
SELECT * FROM `configurations` WHERE (`configurations`.`config_value` = 'HR') LIMIT 1
---
    def list_user
        if params[:user_type] == 'Admin'
            @users = User.find(:all, :conditions => {:admin => true}, :order => 'first_name ASC')
            render(:update) do |page|
                page.replace_html 'users', :partial=> 'users'
                page.replace_html 'employee_user', :text => ''
                page.replace_html 'student_user', :text => ''
            end
        elsif params[:user_type] == 'Zaměstnanec'
            render(:update) do |page|
                hr = Configuration.find_by_config_value("HR")

SELECT * FROM `employees` WHERE (`employees`.`employee_department_id` = '1') ORDER BY first_name ASC
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
    def list_employee_user
        emp_dept = params[:dept_id]
        @employee = Employee.find_all_by_employee_department_id(emp_dept, :order =>'first_name ASC')
        @users = @employee.collect { |employee| employee.user}

SELECT * FROM `students` WHERE (`students`.`is_active` = 1) AND (`students`.`batch_id` = '1') ORDER BY first_name ASC
SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
    def list_student_user
        batch = params[:batch_id]
        @student = Student.find_all_by_batch_id(batch, :conditions => { :is_active => true },:order =>'first_name ASC')
        @users = @student.collect { |student| student.user}

SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'admin' AND `users`.id <> 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2011-11-20 08:40:03', `hashed_password` = '5e28576efe64e68a4372cf15b7c71cb0f396af43' WHERE `id` = 1
---
    def user_change_password
        user = User.find_by_username(params[:id])

        if request.post?
            if params[:user][:new_password]=='' and params[:user][:confirm_password]==''
                flash[:warn_notice]= "<p>Pole hesla nemůže být prázdné!</p>"
            else
                if params[:user][:new_password] == params[:user][:confirm_password]
                    user.password = params[:user][:new_password]
                    user.update_attributes(:password => user.password,
                        :role => user.role_name
                    )

INSERT INTO `employees` (`employee_position_id`, `employee_grade_id`, `experience_year`, `experience_month`, `joining_date`, `home_state`, `created_at`, `photo_file_size`, `job_title`, `employee_department_id`, `nationality_id`, `office_city`, `photo_file_name`, `photo_data`, `updated_at`, `employee_category_id`, `home_city`, `photo_content_type`, `gender`, `father_name`, `home_pin_code`, `office_state`, `home_phone`, `employee_number`, `status_description`, `children_count`, `husband_name`, `blood_group`, `office_pin_code`, `user_id`, `last_name`, `mother_name`, `fax`, `qualification`, `experience_detail`, `date_of_birth`, `home_country_id`, `office_address_line1`, `office_phone1`, `status`, `marital_status`, `home_address_line1`, `office_address_line2`, `office_country_id`, `office_phone2`, `first_name`, `middle_name`, `reporting_manager_id`, `home_address_line2`, `mobile_phone`, `email`) VALUES(1, 1, NULL, NULL, '2006-11-26', NULL, '2011-11-26 10:58:34', NULL, NULL, 1, NULL, NULL, NULL, NULL, '2011-11-26 10:58:34', 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'pokus', NULL, NULL, NULL, NULL, NULL, 3, '', NULL, NULL, NULL, NULL, '1991-11-26', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'pokus', NULL, NULL, NULL, NULL, 'noreplypokus@fedena.com')
INSERT INTO `users` (`salt`, `created_at`, `reset_password_code_until`, `updated_at`, `username`, `admin`, `hashed_password`, `employee`, `reset_password_code`, `last_name`, `student`, `first_name`, `email`) VALUES('Rroh7l1F', '2011-11-26 10:58:34', NULL, '2011-11-26 10:58:34', 'pokus', 0, 'c4fbe2f9b851f9b57ace5cb901f402e823bb31bb', 1, NULL, '', 0, 'pokus', 'noreplypokus@fedena.com')
---
    def create
        @config = Configuration.available_modules

        @user = User.new(params[:user])
        if request.post?

            if @config.include?('HR')
                @employee = Employee.new
                @employee.first_name =  @user.first_name
                @employee.last_name =  @user.last_name
                @employee.employee_number =  @user.username
                @employee.employee_category_id =  1
                @employee.employee_position_id =  1
                @employee.employee_department_id =  1
                @employee.employee_grade_id =  1
                @employee.date_of_birth =  Date.today - 20.year
                @employee.joining_date =  Date.today - 5.year
                if @employee.save and @user.save

SELECT * FROM `employees` WHERE (`employees`.user_id = 1) LIMIT 1
---
    def dashboard
        @user = current_user
        @config = Configuration.available_modules
        @employee = @user.employee_record if ['employee','admin'].include?(@user.role_name.downcase)

SELECT * FROM `users` WHERE (`users`.`username` = 'admin') LIMIT 1
---
    def edit
        @user = User.find_by_username(params[:id])

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'NetworkState') LIMIT 1
---
    def forgot_password
        #    flash[:notice]="Nemáte oprávnění pro přístup k zapomenutému heslu!"
        #    redirect_to :action=>"login"
        @network_state = Configuration.find_by_config_key("NetworkState")

SELECT * FROM `configurations` WHERE (`configurations`.`config_key` = 'LogoName') LIMIT 1
SELECT `users`.id FROM `users` WHERE (`users`.`username` = BINARY 'admin') LIMIT 1
---
    def login
        @institute = Configuration.find_by_config_key("LogoName")
        if request.post? and params[:user]
            @user = User.new(params[:user])
            user = User.find_by_username @user.username

SELECT * FROM `users` WHERE (`users`.`username` = 'admin') LIMIT 1
SELECT * FROM `employees` WHERE (`employees`.`employee_number` = 'admin') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`admission_no` = 'admin') LIMIT 1
---
    def profile
        @config = Configuration.available_modules
        @current_user = current_user
        @username = @current_user.username if session[:user_id]
        @user = User.find_by_username(params[:id])
        unless @user.nil?
            @employee = Employee.find_by_employee_number(@user.username)
            @student = Student.find_by_admission_no(@user.username)