app/controllers/weekday_controller.rb

SELECT * FROM `batches` WHERE (`batches`.`id` = 1)
---
  def week
    @batch = nil
    @days = ["0", "1", "2", "3", "4", "5", "6"]
    @day = ["Neděle", "Pondělí", "Úterý", "Středa", "Čtvrtek", "Pátek", "Sobota"]
    if params[:batch_id] == ''
      @weekdays = Weekday.default
    else
      @weekdays = Weekday.for_batch(params[:batch_id])
      @b  = Batch.find params[:batch_id]

SELECT * FROM `weekdays` WHERE (`weekdays`.`batch_id` = '1') ORDER BY weekday asc
INSERT INTO `weekdays` (`batch_id`, `weekday`) VALUES(1, '2')
---
  def create
    @day = ["Neděle", "Pondělí", "Úterý", "Středa", "Čtvrtek", "Pátek", "Sobota"]
    batch = params[:weekday][:batch_id]
    if request.post?
      new_weekdays = params[:weekdays]||[]
      batch = params[:weekday][:batch_id].empty??  nil:params[:weekday][:batch_id]
      old = Weekday.find_all_by_batch_id(batch)
      old_weekdays = old.map{|w| w.weekday}
      flash[:notice]  = ""
      (new_weekdays-old_weekdays).each do |new|
        Weekday.create(:batch_id =>batch, :weekday=>new.to_s)